<?php
function rus2translit($string) {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
    return strtr($string, $converter);
}

function str2url($str) {
    // переводим в транслит
    $str = rus2translit($str);
    // в нижний регистр
    $str = strtolower($str);
    // заменям все ненужное нам на "-"
    $str = preg_replace('~[^-a-z0-9_]+~u', '-', $str);
    // удаляем начальные и конечные '-'
    $str = trim($str, "-");
    return $str;
}
function addCity($cityName,$CityNamePredl,$CityNameRod)
{
    // Создаем ресурс
    $newCity = $modx->newObject('modResource');

    // Заполняем нужные значения
    $newCity->set('pagetitle',strip_tags($cityName));//сразу удаляем возможные теги
    //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
    $newCity->set('parent','1');
    //$newResource->setContent(strip_tags($formFields['descript']));
    $newCity->set('template','2');
    $newCity->set('published','1');
    $newCity->set('isfolder','1');
    $newCity->set('hidemenu','0');
    $newCity->set('alias',str2url(strip_tags($cityName)));

    // Сохраняем ресурс
    if ($newCity->save()) {
      $city_id = $newCity->get('id');
      $newCity->setTVValue('CityNamePredl',strip_tags($CityNamePredl));//Назва
      $newCity->setTVValue('CityNameRod',strip_tags($CityNameRod));
      $newCity->save();
    // Очищаем кеш, чтобы изменения были видны сразу
      $modx->cacheManager->refresh();
    }
    return $city_id;
}
//Функция формирующая пункты главного мену
function addMenu($cityID)
{
    //+Добавить "Добавить организацию", "Сообщение отправлено"
    $menuName=array("Справочник","Афиша","Город","Новости","Услуги и Объявления","Паблик","Карта");
    $i=0;
    foreach ($menuName as $name)
    {
        $newMenu[]=$modx->newObject('modResource');
        
        $newMenu[$i]->set('pagetitle',strip_tags($name));//сразу удаляем возможные теги
        //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
        $newMenu[$i]->set('parent',$cityID);
        //$newResource->setContent(strip_tags($formFields['descript']));
        //$newCity->set('template','2');
        $newMenu[$i]->set('published','1');
        $newMenu[$i]->set('isfolder','1');
        $newMenu[$i]->set('hidemenu','0');
        $newMenu[$i]->set('richtext','0');
        $newMenu[$i]->set('alias',str2url(strip_tags($name)));
        if($name=='Справочник'){
            $newMenu[$i]->set('template','6');
            $newMenu[$i]->setContent('[[$getAllCompanies]]');
        }

        // Сохраняем ресурс
        if ($newMenu[$i]->save()) {
          $menu_ids[$name] = $newMenu[$i]->get('id');//формируем ассоциативный массив для возвращение из функции
          $newMenu[$i]->save();
          $i++;  
        }
    }
    // Очищаем кеш, чтобы изменения были видны сразу
    $modx->cacheManager->refresh();
    return $menu_ids;//возвращаем ассоциативный массив
}
//Функция для создания категорий справочнка
function addCategoriesCompany($parent_id)
{
    $catNames=array("Авто, мото", "Банки, банкоматы, займы", "Гос. учреждения", "Безопасность", "Зоомир", "Бизнес", "Детский мир", "Доставка еды, напитков", "Магазины", "Кафе, бары, рестораны", "Квартира, дом, дача", "Такси", "Медицина", "Красота и здоровье", "Культура и искусство", "Недвижимость", "Услуги", "Образование", "Развлечения и досуг", "Спорт", "Туризм и гостиницы", "Транспорт, логистика", "Промышленность", "Религия");
    $classNames=array("fa fa-car", "fa fa-money","fa fa-bank","","fa fa-paw", "fa fa-credit-card","fa fa-child","fa fa-cutlery","fa fa-shopping-cart","fa fa-coffee","fa fa-home","fa fa-taxi","","fa fa-medkit","fa fa-music","fa fa-building","fa fa-phone","fa fa-book","fa fa-gamepad","fa fa-futbol-o","fa fa-tree","","","fa fa-asterisk");
    $i=0;
    foreach ($catNames as $name)
    {
        $newCategories[]=$modx->newObject('modResource');
        
        $newCategories[$i]->set('pagetitle',strip_tags($name));//сразу удаляем возможные теги
        //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
        $newCategories[$i]->set('parent',$parent_id);
        //$newResource->setContent(strip_tags($formFields['descript']));
        //$newCity->set('template','2');
        $newCategories[$i]->set('published','1');
        $newCategories[$i]->set('isfolder','1');
        $newCategories[$i]->set('hidemenu','0');
        $newCategories[$i]->set('richtext','0');
        $newCategories[$i]->set('alias',str2url(strip_tags($name)));
        $newCategories[$i]->set('template','6');
        $newCategories[$i]->setContent('[[$getCompanyCat]]');
        
        //Класс для вывода картинки в пункте меню
        // Сохраняем ресурс
        if ($newCategories[$i]->save()) {
          $category_ids[$name] = $newCategories[$i]->get('id');//формируем ассоциативный массив для возвращение из функции
          $newCategories[$i]->setTVValue('classname',strip_tags($classNames[$i]));
          $newCategories[$i]->save();
          $i++;  
        }
    }
    // Очищаем кеш, чтобы изменения были видны сразу
    $modx->cacheManager->refresh();
    return $category_ids;//возвращаем ассоциативный массив
}

function addSubcategories($category_ids)
{
    $subcatNames = array('Авто, мото' => array("Автозапчасти ","Автомойки","Автосалоны","Автосервисы","Автостоянки и паркинги","Авторазборки","Автошколы","АЗС","Аренда авто","Мотосалоны","Шиномонтаж","Шины и диски","Другое"), 
        'Банки, банкоматы, займы' => array("Банки", "Банкоматы", "Займы", "Операционные кассы", "Другое"),
        'Гос. учреждения' => array("Администрация", "Налоговые инспекции и фонды", "Отделения полиции и ГИБДД", "Отделения почты", "Суды", "Вокзалы, аэропорты", "Гос.органы и учреждения", "Аварийные и справочные службы", "Научные организации", "Общественные организации, партии", "Посольства и Представительства", "Другое"),
        'Безопасность' => array("Охрана объектов и квартир","Другое"),
        'Зоомир' => array("Ветклиники","Зоомагазины","Услуги","Другое"),
        'Бизнес' => array("Бухгалтерия и аудит", "Изготовление печатей, штампов", "Кадровые агентства", "Нотариусы", "Оборудование для сферы услуг", "Реклама", "Типографии", "Юридические услуги", "Другое"),
        'Детский мир' => array("Детские сады", "Детское питание", "Магазины игрушек", "Одежда и обувь для детей", "Развивающие центры", "Детские дома", "Центры творчества и досуга", "Другое"),
        'Доставка еды, напитков' => array("Доставка еды из ресторанов", "Доставка пиццы", "Доставка продуктов на дом", "Доставка роллов, суши", "Доставка воды", "Доставка напитков", "Другое"),
        'Магазины' => array("Second Hand", "Бижутерия", "Бытовая техника", "Бытовая химия", "Все для ремонта", "Стройматериалы", "Инструменты", "Интернет-магазины", "Интим-магазины", "Канцтовары", "Книги, журналы, пресса", "Кожгалантерея", "Компьютеры, оргтехника", "Косметика и парфюмерия", "Ломбарды", "Мебель", "Мобильная связь", "Мультимедия", "Напитки и алкоголь", "Народный промысел", "Нижнее белье", "Обувь", "Одежда", "Оптика", "Подарки", "Постельное белье", "Посуда", "Продукты, овощи, фрукты", "Промышленное оборудование", "Рынки", "Свадебные салоны", "Сумки, чемоданы", "Табак", "Ткани", "Товары для детей", "Товары для дома, дачи", "Универсамы, супермаркеты", "Хозтовары", "Цветы", "Часы", "Ювелирный", "Другое"),
        'Кафе, бары, рестораны' => array("Столовые, трапезные", "Шашлычные", "Спортбары, пабы, бары", "Рестораны", "Кофейня", "Кафе", "Фастфуд", "Суши, роллы", "Банкетные залы", "Кейтринг", "Другое"),
        'Квартира, дом, дача' => array("Всё для ремонта", "Двери", "Дизайн интерьеров", "Канализация, отопление", "Мебельные магазины", "Окна", "Предметы интерьера", "Сантехника", "Ткань, текстиль, матрасы, шторы", "Товары для садоводов", "Электрика", "Обои и краски", "Напольные покрытия, потолок", "Другое"),
        'Такси' => array("Такси","Лимузины","Автобусы","Другое"),
        'Медицина' => array("Аптеки", "Больницы и поликлиники", "Медицинские центры", "Медицинские услуги", "Санатории, диспансеры", "Стоматология", "Товары и оборудование", "Реалибитационные центры", "Другое"),
        'Красота и здоровье' => array("Маникюр, педикюр", "Парикмахерские", "Салоны красоты", "Сауны", "Солярий", "Выездные мастера", "Другое"),
        'Культура и искусство' => array("Библиотеки", "Билетные кассы", "Театры и галереи", "Дома культуры", "Выставочные центры", "Музеи", "Другое"),
        'Недвижимость' => array("Агенства недвижимости", "Жилищно-коммунальное хозяйство", "Другое"),
        'Услуги' => array("Ателье", "Управляющие компании, ЖКХ, ТСЖ", "Общежития", "Эксперты и оценка", "Проектирование", "Охрана, ЧОП", "Ксерокопия", "Клининговые компании", "Металлоремонт", "Организация праздников", "Психология", "Ремонт квартир, офисов", "Ремонт обуви", "Печатные салоны", "Ремонт техники", "Ритуальные услуги", "Страхование", "Ремонт, строительство", "Создание сайтов", "Климатическое оборудование", "ТВ и Интернет, СМИ", "Фото, видео", "Химчистка", "Ювелирная мастерская", "Нотариусы и юристы", "Другое"),
        'Образование' => array("Высшее и профессиональное образование", "Дошкольные учреждения", "Курсы, тренинги", "Школы", "Профильные школы", "Другое"),
        'Развлечения и досуг' => array("Бильярд", "Боулинг", "Кинотеатры", "Ночные клубы", "Семейные центры", "Аквапарки", "Картинг", "Музеи", "Старйкбол", "Другое"),
        'Спорт' => array("Спортивные сооружения", "Магазины спорт-товаров", "Спортивные школы", "Ставки, БК", "Фитнес, йога", "Бассейны", "Спорт секции", "Другое"),
        'Туризм и гостиницы' => array("Отели и гостиницы", "Авиа, ж/д, авто билеты", "Экскурсии", "Охота и рыбалка", "Сопутствующие товары", "Туристические агентства", "Другое"),
        'Транспорт, логистика' => array("Перевозки, доставка", "Городской транспорт", "Водный транспорт", "Железнодорожный транспорт", "Авиаперевозки", "Другое"),
        'Промышленность' => array("Фабрики", "Заводы", "Виноделы", "Другое"),
        'Религия' => array("Церковные лавки", "Храмы", "Церкви", "Мечети", "Другое")
    );
    $i=0;
    $j=0;
    foreach ($category_ids as $key=>$cat_id)
    {
        foreach ($subcatNames as $section=>$items)
            foreach ($items as $subcat)
            {
                $newSubCategories[]=$modx->newObject('modResource');

                $newSubCategories[$i]->set('pagetitle',strip_tags($subcat));//сразу удаляем возможные теги
                //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
                $newSubCategories[$i]->set('parent',$cat_id);
                //$newResource->setContent(strip_tags($formFields['descript']));
                //$newCity->set('template','2');
                $newSubCategories[$i]->set('published','1');
                $newSubCategories[$i]->set('isfolder','1');
                $newSubCategories[$i]->set('hidemenu','0');
                $newSubCategories[$i]->set('richtext','0');
                $newSubCategories[$i]->set('alias',str2url(strip_tags($subcat)));
                $newSubCategories[$i]->set('template','6');
                $newSubCategories[$i]->setContent('[[$getCompany]]');

                //Класс для вывода картинки в пункте меню
                // Сохраняем ресурс
                if ($newSubCategories[$i]->save()) {
                  $subcategory_ids[$subcat] = $newSubCategories[$i]->get('id');//формируем ассоциативный массив для возвращение из функции
                  $newSubCategories[$i]->save();
                  $i++;  
                }
            }
            
            $newVseCategories[]=$modx->newObject('modResource');
            $newVseCategories[$j]->set('pagetitle',"Все");//сразу удаляем возможные теги
            //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
            $newVseCategories[$j]->set('parent',$cat_id);
            //$newResource->setContent(strip_tags($formFields['descript']));
            //$newCity->set('template','2');
            $newVseCategories[$j]->set('published','1');
            $newVseCategories[$j]->set('isfolder','1');
            $newVseCategories[$j]->set('hidemenu','0');
            $newVseCategories[$j]->set('richtext','0');
            $newVseCategories[$j]->set('alias',str2url(strip_tags("Все")));
            $newVseCategories[$j]->set('template','6');
            $newVseCategories[$j]->setContent('[[$getAllCompaniesVse]]');

            //Класс для вывода картинки в пункте меню
            // Сохраняем ресурс
            if ($newVseCategories[$j]->save()) {
              //$subcategory_ids[$subcat] = $newVseCategories[$j]->get('id');//формируем ассоциативный массив для возвращение из функции
              $newVseCategories[$j]->save();
              $j++;  
            }
            
    }
    // Очищаем кеш, чтобы изменения были видны сразу
    $modx->cacheManager->refresh();
    return $subcategory_ids;//возвращаем ассоциативный массив
}
// Создаем массив с названиями категорий
// Перебираем массив с названиями, создавая при этом соответствующие ресурсы
// Формируем массива формата ключ=>значение, в котором ключ=название ресурса
// значение=id ресурса и возвращаем этот массив из функции
// создаем еще одну функцию, в которой создаем подкатегории аналогичным способом
// для каждой категории
return true;




//Рабочий вариант
    $parent_id=160;
    $catNames=array("Авто, мото", "Банки, банкоматы, займы", "Гос. учреждения", "Безопасность", "Зоомир", "Бизнес", "Детский мир", "Доставка еды, напитков", "Магазины", "Кафе, бары, рестораны", "Квартира, дом, дача", "Такси", "Медицина", "Красота и здоровье", "Культура и искусство", "Недвижимость", "Услуги", "Образование", "Развлечения и досуг", "Спорт", "Туризм и гостиницы", "Транспорт, логистика", "Промышленность", "Религия");
    $classNames=array("fa fa-car", "fa fa-money","fa fa-bank","fa fa-shield","fa fa-paw", "fa fa-credit-card","fa fa-child","fa fa-cutlery","fa fa-shopping-cart","fa fa-coffee","fa fa-home","fa fa-taxi","fa fa-medkit","fa fa-leaf","fa fa-music","fa fa-building","fa fa-phone","fa fa-book","fa fa-gamepad","fa fa-futbol-o","fa fa-tree","fa fa-truck","fa fa-cogs","fa fa-asterisk");
    $i=0;
    $newCategories[]=$modx->newObject('modResource');
    foreach ($catNames as $name)
    {
        
        
        $newCategories[$i]->set('pagetitle',strip_tags($name));//сразу удаляем возможные теги
        //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
        $newCategories[$i]->set('parent',$parent_id);
        //$newResource->setContent(strip_tags($formFields['descript']));
        //$newCity->set('template','2');
        $newCategories[$i]->set('published','1');
        $newCategories[$i]->set('isfolder','1');
        $newCategories[$i]->set('hidemenu','0');
        $newCategories[$i]->set('richtext','0');
        $newCategories[$i]->set('alias',str2url(strip_tags($name)));
        $newCategories[$i]->set('template','6');
        $newCategories[$i]->setContent('[[$getCompanyCat]]');
        
        //Класс для вывода картинки в пункте меню
        // Сохраняем ресурс
        if ($newCategories[$i]->save()) {
          $category_ids[] = $newCategories[$i]->get('id');//формируем ассоциативный массив для возвращение из функции
          $newCategories[$i]->setTVValue('classname',strip_tags($classNames[$i]));
          $newCategories[$i]->save();
          $i++;  
        }
    }
    




    $subcatNames = array('Авто, мото' => array("Автозапчасти ","Автомойки","Автосалоны","Автосервисы","Автостоянки и паркинги","Авторазборки","Автошколы","АЗС","Аренда авто","Мотосалоны","Шиномонтаж","Шины и диски","Другое"), 
        'Банки, банкоматы, займы' => array("Банки", "Банкоматы", "Займы", "Операционные кассы", "Другое"),
        'Гос. учреждения' => array("Администрация", "Налоговые инспекции и фонды", "Отделения полиции и ГИБДД", "Отделения почты", "Суды", "Вокзалы, аэропорты", "Гос.органы и учреждения", "Аварийные и справочные службы", "Научные организации", "Общественные организации, партии", "Посольства и Представительства", "Другое"),
        'Безопасность' => array("Охрана объектов и квартир","Другое"),
        'Зоомир' => array("Ветклиники","Зоомагазины","Услуги","Другое"),
        'Бизнес' => array("Бухгалтерия и аудит", "Изготовление печатей, штампов", "Кадровые агентства", "Нотариусы", "Оборудование для сферы услуг", "Реклама", "Типографии", "Юридические услуги", "Другое"),
        'Детский мир' => array("Детские сады", "Детское питание", "Магазины игрушек", "Одежда и обувь для детей", "Развивающие центры", "Детские дома", "Центры творчества и досуга", "Другое"),
        'Доставка еды, напитков' => array("Доставка еды из ресторанов", "Доставка пиццы", "Доставка продуктов на дом", "Доставка роллов, суши", "Доставка воды", "Доставка напитков", "Другое"),
        'Магазины' => array("Second Hand", "Бижутерия", "Бытовая техника", "Бытовая химия", "Все для ремонта", "Стройматериалы", "Инструменты", "Интернет-магазины", "Интим-магазины", "Канцтовары", "Книги, журналы, пресса", "Кожгалантерея", "Компьютеры, оргтехника", "Косметика и парфюмерия", "Ломбарды", "Мебель", "Мобильная связь", "Мультимедия", "Напитки и алкоголь", "Народный промысел", "Нижнее белье", "Обувь", "Одежда", "Оптика", "Подарки", "Постельное белье", "Посуда", "Продукты, овощи, фрукты", "Промышленное оборудование", "Рынки", "Свадебные салоны", "Сумки, чемоданы", "Табак", "Ткани", "Товары для детей", "Товары для дома, дачи", "Универсамы, супермаркеты", "Хозтовары", "Цветы", "Часы", "Ювелирный", "Другое"),
        'Кафе, бары, рестораны' => array("Столовые, трапезные", "Шашлычные", "Спортбары, пабы, бары", "Рестораны", "Кофейня", "Кафе", "Фастфуд", "Суши, роллы", "Банкетные залы", "Кейтринг", "Другое"),
        'Квартира, дом, дача' => array("Всё для ремонта", "Двери", "Дизайн интерьеров", "Канализация, отопление", "Мебельные магазины", "Окна", "Предметы интерьера", "Сантехника", "Ткань, текстиль, матрасы, шторы", "Товары для садоводов", "Электрика", "Обои и краски", "Напольные покрытия, потолок", "Другое"),
        'Такси' => array("Такси","Лимузины","Автобусы","Другое"),
        'Медицина' => array("Аптеки", "Больницы и поликлиники", "Медицинские центры", "Медицинские услуги", "Санатории, диспансеры", "Стоматология", "Товары и оборудование", "Реалибитационные центры", "Другое"),
        'Красота и здоровье' => array("Маникюр, педикюр", "Парикмахерские", "Салоны красоты", "Сауны", "Солярий", "Выездные мастера", "Другое"),
        'Культура и искусство' => array("Библиотеки", "Билетные кассы", "Театры и галереи", "Дома культуры", "Выставочные центры", "Музеи", "Другое"),
        'Недвижимость' => array("Агенства недвижимости", "Жилищно-коммунальное хозяйство", "Другое"),
        'Услуги' => array("Ателье", "Управляющие компании, ЖКХ, ТСЖ", "Общежития", "Эксперты и оценка", "Проектирование", "Охрана, ЧОП", "Ксерокопия", "Клининговые компании", "Металлоремонт", "Организация праздников", "Психология", "Ремонт квартир, офисов", "Ремонт обуви", "Печатные салоны", "Ремонт техники", "Ритуальные услуги", "Страхование", "Ремонт, строительство", "Создание сайтов", "Климатическое оборудование", "ТВ и Интернет, СМИ", "Фото, видео", "Химчистка", "Ювелирная мастерская", "Нотариусы и юристы", "Другое"),
        'Образование' => array("Высшее и профессиональное образование", "Дошкольные учреждения", "Курсы, тренинги", "Школы", "Профильные школы", "Другое"),
        'Развлечения и досуг' => array("Бильярд", "Боулинг", "Кинотеатры", "Ночные клубы", "Семейные центры", "Аквапарки", "Картинг", "Музеи", "Старйкбол", "Другое"),
        'Спорт' => array("Спортивные сооружения", "Магазины спорт-товаров", "Спортивные школы", "Ставки, БК", "Фитнес, йога", "Бассейны", "Спорт секции", "Другое"),
        'Туризм и гостиницы' => array("Отели и гостиницы", "Авиа, ж/д, авто билеты", "Экскурсии", "Охота и рыбалка", "Сопутствующие товары", "Туристические агентства", "Другое"),
        'Транспорт, логистика' => array("Перевозки, доставка", "Городской транспорт", "Водный транспорт", "Железнодорожный транспорт", "Авиаперевозки", "Другое"),
        'Промышленность' => array("Фабрики", "Заводы", "Виноделы", "Другое"),
        'Религия' => array("Церковные лавки", "Храмы", "Церкви", "Мечети", "Другое")
    );
    $k=0;
    $j=0;
    $newVseCategories[]=$modx->newObject('modResource');
        foreach ($subcatNames as $section=>$items)
        {
            
            $newVseCategories[$j]->set('pagetitle',"Все");//сразу удаляем возможные теги
            //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
            $newVseCategories[$j]->set('parent',$category_ids[$j]);
            //$newResource->setContent(strip_tags($formFields['descript']));
            //$newCity->set('template','2');
            $newVseCategories[$j]->set('published','1');
            $newVseCategories[$j]->set('isfolder','1');
            $newVseCategories[$j]->set('hidemenu','0');
            $newVseCategories[$j]->set('richtext','0');
            $newVseCategories[$j]->set('alias',str2url(strip_tags("Все")));
            $newVseCategories[$j]->set('template','6');
            $newVseCategories[$j]->setContent('[[$getAllCompaniesVse]]');

            //Класс для вывода картинки в пункте меню
            // Сохраняем ресурс
            if ($newVseCategories[$j]->save()) {
              //$subcategory_ids[$subcat] = $newVseCategories[$j]->get('id');//формируем ассоциативный массив для возвращение из функции
              $newVseCategories[$j]->save();
                
            }
            $newSubCategories[]=$modx->newObject('modResource');
            foreach ($items as $subcat)
            {
                

                $newSubCategories[$k]->set('pagetitle',strip_tags($subcat));//сразу удаляем возможные теги
                //$newCity->set('pagetitle',strip_tags($formFields['name']));//сразу удаляем возможные теги
                $newSubCategories[$k]->set('parent',$category_ids[$j]);
                //$newResource->setContent(strip_tags($formFields['descript']));
                //$newCity->set('template','2');
                $newSubCategories[$k]->set('published','1');
                $newSubCategories[$k]->set('isfolder','1');
                $newSubCategories[$k]->set('hidemenu','0');
                $newSubCategories[$k]->set('richtext','0');
                $newSubCategories[$k]->set('alias',str2url(strip_tags($subcat)));
                $newSubCategories[$k]->set('template','6');
                $newSubCategories[$k]->setContent('[[$getCompany]]');

                //Класс для вывода картинки в пункте меню
                // Сохраняем ресурс
                if ($newSubCategories[$k]->save()) {
                  $subcategory_ids[$subcat] = $newSubCategories[$k]->get('id');//формируем ассоциативный массив для возвращение из функции
                  $newSubCategories[$k]->save();
                  $k++;  
                }
            }
        
            $j++;
         }   
    
    // Очищаем кеш, чтобы изменения были видны сразу
    $modx->cacheManager->refresh();

